import { z } from "zod";

export const loginSchema = z.object({
  email: z
    .string()
    .trim()
    .min(1, "Поле є обов'язковим")
    .max(50, "Максимальна довжина - 50 символів")
    .pipe(z.email("Повинен відповідати формату email (example@domain.com)")),
  password: z
    .string()
    .min(1, "Поле є обов'язковим")
    .min(12, "Мінімальна довжина - 12 символів")
    .max(64, "Максимальна довжина - 64 символи")
    .regex(/[A-Z]/, "Повинен містити щонайменше одну велику літеру")
    .regex(/[a-z]/, "Повинен містити щонайменше одну малу літеру")
    .regex(/[0-9]/, "Повинен містити щонайменше одну цифру")
    .regex(/[!@#$%^&*()_+\-=\[\]{}|\\:;"'<>,.?/]/, "Повинен містити щонайменше один спеціальний символ"),
});
